In [1]:
import pandas as pd

df_demo = pd.read_csv("/Users/ZINA/Desktop/IRONHACK/Week_5/Project/df_final_demo.txt")
df_web1 = pd.read_csv("/Users/ZINA/Desktop/IRONHACK/Week_5/Project/df_final_web_data_pt_1.txt")
df_web2 = pd.read_csv("/Users/ZINA/Desktop/IRONHACK/Week_5/Project/df_final_web_data_pt_2.txt")
df_exp = pd.read_csv("/Users/ZINA/Desktop/IRONHACK/Week_5/Project/df_final_experiment_clients.txt")

In [2]:
df_demo.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [3]:
df_demo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [ ]:
# 70609 clients 
# only gender column is an object (string)
# 14-15 missing rows per column : dataset is largely complete with very few missing values
# clnt_tenure_yr/clnt_tenure_mnth : how long they have been clients
# num_accts = number of accounts

In [15]:
df_demo.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [28]:
df_demo["gendr"].unique() # Gender has inconsistent labels

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [27]:
df_demo['gendr'].value_counts() # U = unknown data is very large : 24122

gendr
U    24122
M    23724
F    22746
X        3
Name: count, dtype: int64

In [29]:
# creating a clean age column (for clarity only no changes made)
df_demo['gender_clean'] = df_demo['gendr'].replace({'M': 'Male','F': 'Female','U': 'Unknown','X': 'Other'})
df_demo['gender_clean'] = df_demo['gender_clean'].fillna('Unknown')
df_demo

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth,gender_clean
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0,Unknown
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0,Unknown
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0,Unknown
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0,Male
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0,Female
...,...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0,Unknown
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0,Male
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0,Female
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0,Male
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0,Female

In [34]:
df_demo['gender_clean'].isna().sum() # to check

np.int64(0)

In [5]:
df_web1.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [6]:
df_web1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343141 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     343141 non-null  int64
 1   visitor_id    343141 non-null  object
 2   visit_id      343141 non-null  object
 3   process_step  343141 non-null  object
 4   date_time     343141 non-null  object
dtypes: int64(1), object(4)
memory usage: 13.1+ MB

In [7]:
df_web2.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [8]:
df_web2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412264 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     412264 non-null  int64
 1   visitor_id    412264 non-null  object
 2   visit_id      412264 non-null  object
 3   process_step  412264 non-null  object
 4   date_time     412264 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.7+ MB

In [9]:
df_exp.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [10]:
df_exp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [ ]:
# 70609 entries : same as number of clients in df_demo
# variation : 20109 missing data

In [13]:
# Concatenating the two web datasets 
df_web = pd.concat([df_web1, df_web2], axis=0)

In [19]:
df_web.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [14]:
df_web.info()

<class 'pandas.core.frame.DataFrame'>
Index: 755405 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     755405 non-null  int64
 1   visitor_id    755405 non-null  object
 2   visit_id      755405 non-null  object
 3   process_step  755405 non-null  object
 4   date_time     755405 non-null  object
dtypes: int64(1), object(4)
memory usage: 34.6+ MB

In [ ]:
# 755405 entries : no missing values 
# multiple rows per client : behavioral events
# date_time column is an object : needs to be converted

In [20]:
# convert date_time column from object to a datetime
df_web['date_time'] = pd.to_datetime(df_web['date_time'])

In [21]:
# checking if datetime conversion worked : 
df_web.info()

<class 'pandas.core.frame.DataFrame'>
Index: 755405 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     755405 non-null  int64
 1   visitor_id    755405 non-null  object
 2   visit_id      755405 non-null  object
 3   process_step  755405 non-null  object
 4   date_time     755405 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 34.6+ MB

In [22]:
df_web['process_step'].value_counts()

process_step
start      243945
step_1     163193
step_2     133062
step_3     112242
confirm    102963
Name: count, dtype: int64

In [23]:
df_web['client_id'].nunique()

120157

In [24]:
df_web['visit_id'].nunique()

158095